In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn import preprocessing

In [43]:
d = pd.read_csv('C:\\Users\\ABHAS\\Downloads\\train (1).csv')

In [44]:
test = pd.read_csv("C:\\Users\\ABHAS\\Downloads\\test.csv")
temp = test
test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [45]:
cols = ['SibSp','Parch','Fare','Age']
for i in cols:
    d.fillna(d[cols].mean(),inplace=True)

In [46]:
d.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [47]:
from sklearn.preprocessing import LabelEncoder, StandardScaler

l = preprocessing.LabelEncoder()
d['Sex'] = l.fit_transform(d['Sex'])
test['Sex'] = l.transform(test['Sex'])

In [49]:
d['Embarked'] = l.fit_transform(d['Embarked'])
test['Embarked'] = l.transform(test['Embarked'])

In [50]:
drop = ['Name','PassengerId','Ticket','Cabin']
d = d.drop(labels=drop,axis = 1)
test = test.drop(labels=drop,axis = 1)
d.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

In [51]:
test.shape

(418, 7)

In [8]:
d.describe()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,0.647587,29.699118,0.523008,0.381594,32.204208,1.538721
std,0.486592,0.836071,0.477990,13.002015,1.102743,0.806057,49.693429,0.794231
min,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,2.000000,0.000000,22.000000,0.000000,0.000000,7.910400,1.000000
50%,0.000000,3.000000,1.000000,29.699118,0.000000,0.000000,14.454200,2.000000
75%,1.000000,3.000000,1.000000,35.000000,1.000000,0.000000,31.000000,2.000000
max,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,512.329200,3.000000

In [52]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier

y = d.Survived
x = d.drop(['Survived'],axis = 1)

In [53]:
X_train, X_val,Y_train,Y_val = train_test_split(x,y,train_size=0.7,random_state= 40)

In [54]:
from sklearn.model_selection import cross_val_score, cross_val_predict

In [55]:
clf = LogisticRegression(max_iter=1000,random_state=0)
clf = clf.fit(X_train,Y_train)
prediction = clf.predict(X_val)

In [56]:
rfc = RandomForestClassifier()
rfc.fit(X_train,Y_train)
pred = rfc.predict(X_val)

In [57]:
from sklearn.metrics import accuracy_score
print(accuracy_score(Y_val,prediction))
print(accuracy_score(Y_val,pred))

0.8022388059701493
0.8134328358208955

In [58]:
for i in cols:
    test.fillna(d[cols].mean(),inplace=True)

In [59]:
test.shape

(418, 7)

In [60]:
predfinal = rfc.predict(test)

In [61]:
prediction = pd.Series(predfinal)
prediction

0      0
1      0
2      0
3      1
4      0
      ..
413    0
414    1
415    0
416    0
417    1
Length: 418, dtype: int64

In [83]:
submission = pd.DataFrame({"Survived" : prediction ,'PassengerId' :temp['PassengerId']})

In [85]:
submission.head()

   Survived  PassengerId
0         0          892
1         0          893
2         0          894
3         1          895
4         0          896

In [84]:
submission.to_csv("Submission.csv",index=False)